import * as React from "react";
import Svg from "../Svg";
import { SvgProps } from "../types";

const Icon: React.FC<SvgProps> = (props) => {
  return (
    <Svg viewBox="0 0 44 37" {...props}>
      <g id="官网" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
        <g id="最新官网" transform="translate(-745.000000, -3299.000000)" fill="#FFFFFF" fill-rule="nonzero">
          <g id="编组-12" transform="translate(470.000000, 3161.000000)">
            <g id="组_4759" transform="translate(257.000000, 116.000000)">
              <path d="M34.5650858,56.7432537 L35.2480358,46.3928695 L53.9962015,29.4585202 C54.8268164,28.6999501 53.8248048,28.3325591 52.7278657,28.9933344 L29.584033,43.6519736 L19.5639163,40.4802521 C17.414865,39.8696958 17.3911331,38.3657712 20.0517378,37.3085307 L59.0379023,22.2428539 C60.8204283,21.434065 62.5291219,22.6842518 61.8461719,25.4145753 L55.2065261,56.7617554 C54.7424365,58.9872467 53.4002682,59.5264393 51.5439098,58.4982729 L41.4367763,51.0103673 L36.5796566,55.7335891 C36.0974858,56.3612154 35.3553061,56.7331818 34.5650858,56.7432537 Z" id="路径_5601"></path>
            </g>
          </g>
        </g>
      </g>
    </Svg>
  );
};

export default Icon;
